Autodesk.Revit.DB.GeometryTypeConversionPriorities.IsEnabled
Queries whether the targets specify that conversion should occur or not.
Since:
2022

Autodesk.Revit.DB.GeometryTypeConversionPriorities.GetTargets
Retrieve the desired targets to try in order.
Since:
2022

Autodesk.Revit.DB.GeometryTypeConversionPriorities.TargetsAreValid(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryConversionTarget})
Checks whether the targets are a valid combination.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.GeometryTypeConversionPriorities.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryConversionTarget})
Specifies conversion where we try the specified targets in the order of the array.
The result is the first one to succeed, if none succeed then nothing is created.
The input array of targets must at least specify one choice, even if that is None.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The requested combination of targets is invalid.
Since:
2022